__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, None, 408)    0                                            
__________________________________________________________________________________________________
onehot (Lambda)                 (None, None, 21)     0           input_1[0][0]                    
__________________________________________________________________________________________________
sequenceprofile (Lambda)        (None, None, 21)     0           input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, 42)     0           onehot[0][0]                     
                                                                 sequenceprofile[0][0]            
__________________________________________________________________________________________________
batchnorm_input (BatchNormaliza (None, None, 42)     168         concatenate_1[0][0]              
__________________________________________________________________________________________________
conv1 (Conv1D)                  (None, None, 256)    32512       batchnorm_input[0][0]            
__________________________________________________________________________________________________
conv2 (Conv1D)                  (None, None, 256)    54016       batchnorm_input[0][0]            
__________________________________________________________________________________________________
conv3 (Conv1D)                  (None, None, 256)    75520       batchnorm_input[0][0]            
__________________________________________________________________________________________________
conv4 (Conv1D)                  (None, None, 256)    118528      batchnorm_input[0][0]            
__________________________________________________________________________________________________
conv5 (Conv1D)                  (None, None, 256)    226048      batchnorm_input[0][0]            
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, None, 1280)   0           conv1[0][0]                      
                                                                 conv2[0][0]                      
                                                                 conv3[0][0]                      
                                                                 conv4[0][0]                      
                                                                 conv5[0][0]                      
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 256)    983296      concatenate_2[0][0]              
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 256)    1638656     concatenate_2[0][0]              
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 256)    2294016     concatenate_2[0][0]              
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, None, 256)    3604736     concatenate_2[0][0]              
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, None, 256)    6881536     concatenate_2[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, None, 1280)   0           conv1d_1[0][0]                   
                                                                 conv1d_2[0][0]                   
                                                                 conv1d_3[0][0]                   
                                                                 conv1d_4[0][0]                   
                                                                 conv1d_5[0][0]                   
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, None, 1280)   0           concatenate_2[0][0]              
                                                                 concatenate_3[0][0]              
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, None, 1280)   0           lambda_1[0][0]                   
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, None, 256)    983296      dropout_1[0][0]                  
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, None, 256)    1638656     dropout_1[0][0]                  
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, None, 256)    2294016     dropout_1[0][0]                  
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, None, 256)    3604736     dropout_1[0][0]                  
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, None, 256)    6881536     dropout_1[0][0]                  
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, None, 1280)   0           conv1d_6[0][0]                   
                                                                 conv1d_7[0][0]                   
                                                                 conv1d_8[0][0]                   
                                                                 conv1d_9[0][0]                   
                                                                 conv1d_10[0][0]                  
__________________________________________________________________________________________________
lambda_2 (Lambda)               (None, None, 1280)   0           dropout_1[0][0]                  
                                                                 concatenate_4[0][0]              
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, None, 1280)   0           lambda_2[0][0]                   
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, None, 256)    983296      dropout_2[0][0]                  
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, None, 256)    1638656     dropout_2[0][0]                  
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, None, 256)    2294016     dropout_2[0][0]                  
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, None, 256)    3604736     dropout_2[0][0]                  
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, None, 256)    6881536     dropout_2[0][0]                  
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, None, 1280)   0           conv1d_11[0][0]                  
                                                                 conv1d_12[0][0]                  
                                                                 conv1d_13[0][0]                  
                                                                 conv1d_14[0][0]                  
                                                                 conv1d_15[0][0]                  
__________________________________________________________________________________________________
lambda_3 (Lambda)               (None, None, 1280)   0           dropout_2[0][0]                  
                                                                 concatenate_5[0][0]              
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, None, 1280)   0           lambda_3[0][0]                   
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, None, 1280)   1639680     dropout_3[0][0]                  
__________________________________________________________________________________________________
time_distributed_1 (TimeDistrib (None, None, 9)      11529       dense_2[0][0]                    
==================================================================================================
Total params: 48,364,721
Trainable params: 48,364,637
Non-trainable params: 84
__________________________________________________________________________________________________
